MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c551xx.h
/* *************************************  Bit definition for ADC_SQR2 register  ************************************* */
#define ADC_SQR2_SQ5_Pos         (0U)
#define ADC_SQR2_SQ5_Msk         (0x1FUL << ADC_SQR2_SQ5_Pos)          /*!< 0x0000001F */
#define ADC_SQR2_SQ5             ADC_SQR2_SQ5_Msk                      /*!< 5th conversion in regular sequence */
#define ADC_SQR2_SQ5_0           (0x1UL << ADC_SQR2_SQ5_Pos)           /*!< 0x00000001 */
#define ADC_SQR2_SQ5_1           (0x2UL << ADC_SQR2_SQ5_Pos)           /*!< 0x00000002 */
#define ADC_SQR2_SQ5_2           (0x4UL << ADC_SQR2_SQ5_Pos)           /*!< 0x00000004 */
#define ADC_SQR2_SQ5_3           (0x8UL << ADC_SQR2_SQ5_Pos)           /*!< 0x00000008 */
#define ADC_SQR2_SQ5_4           (0x10UL << ADC_SQR2_SQ5_Pos)          /*!< 0x00000010 */
#define ADC_SQR2_SQ6_Pos         (6U)
#define ADC_SQR2_SQ6_Msk         (0x1FUL << ADC_SQR2_SQ6_Pos)          /*!< 0x000007C0 */
#define ADC_SQR2_SQ6             ADC_SQR2_SQ6_Msk                      /*!< 6th conversion in regular sequence */
#define ADC_SQR2_SQ6_0           (0x1UL << ADC_SQR2_SQ6_Pos)           /*!< 0x00000040 */
#define ADC_SQR2_SQ6_1           (0x2UL << ADC_SQR2_SQ6_Pos)           /*!< 0x00000080 */
#define ADC_SQR2_SQ6_2           (0x4UL << ADC_SQR2_SQ6_Pos)           /*!< 0x00000100 */
#define ADC_SQR2_SQ6_3           (0x8UL << ADC_SQR2_SQ6_Pos)           /*!< 0x00000200 */
#define ADC_SQR2_SQ6_4           (0x10UL << ADC_SQR2_SQ6_Pos)          /*!< 0x00000400 */
#define ADC_SQR2_SQ7_Pos         (12U)
#define ADC_SQR2_SQ7_Msk         (0x1FUL << ADC_SQR2_SQ7_Pos)          /*!< 0x0001F000 */
#define ADC_SQR2_SQ7             ADC_SQR2_SQ7_Msk                      /*!< 7th conversion in regular sequence */
#define ADC_SQR2_SQ7_0           (0x1UL << ADC_SQR2_SQ7_Pos)           /*!< 0x00001000 */
#define ADC_SQR2_SQ7_1           (0x2UL << ADC_SQR2_SQ7_Pos)           /*!< 0x00002000 */
#define ADC_SQR2_SQ7_2           (0x4UL << ADC_SQR2_SQ7_Pos)           /*!< 0x00004000 */
#define ADC_SQR2_SQ7_3           (0x8UL << ADC_SQR2_SQ7_Pos)           /*!< 0x00008000 */
#define ADC_SQR2_SQ7_4           (0x10UL << ADC_SQR2_SQ7_Pos)          /*!< 0x00010000 */
#define ADC_SQR2_SQ8_Pos         (18U)
#define ADC_SQR2_SQ8_Msk         (0x1FUL << ADC_SQR2_SQ8_Pos)          /*!< 0x007C0000 */
#define ADC_SQR2_SQ8             ADC_SQR2_SQ8_Msk                      /*!< 8th conversion in regular sequence */
#define ADC_SQR2_SQ8_0           (0x1UL << ADC_SQR2_SQ8_Pos)           /*!< 0x00040000 */
#define ADC_SQR2_SQ8_1           (0x2UL << ADC_SQR2_SQ8_Pos)           /*!< 0x00080000 */
#define ADC_SQR2_SQ8_2           (0x4UL << ADC_SQR2_SQ8_Pos)           /*!< 0x00100000 */
#define ADC_SQR2_SQ8_3           (0x8UL << ADC_SQR2_SQ8_Pos)           /*!< 0x00200000 */
#define ADC_SQR2_SQ8_4           (0x10UL << ADC_SQR2_SQ8_Pos)          /*!< 0x00400000 */
#define ADC_SQR2_SQ9_Pos         (24U)
#define ADC_SQR2_SQ9_Msk         (0x1FUL << ADC_SQR2_SQ9_Pos)          /*!< 0x1F000000 */
#define ADC_SQR2_SQ9             ADC_SQR2_SQ9_Msk                      /*!< 9th conversion in regular sequence */
#define ADC_SQR2_SQ9_0           (0x1UL << ADC_SQR2_SQ9_Pos)           /*!< 0x01000000 */
#define ADC_SQR2_SQ9_1           (0x2UL << ADC_SQR2_SQ9_Pos)           /*!< 0x02000000 */
#define ADC_SQR2_SQ9_2           (0x4UL << ADC_SQR2_SQ9_Pos)           /*!< 0x04000000 */
#define ADC_SQR2_SQ9_3           (0x8UL << ADC_SQR2_SQ9_Pos)           /*!< 0x08000000 */
#define ADC_SQR2_SQ9_4           (0x10UL << ADC_SQR2_SQ9_Pos)          /*!< 0x10000000 */

/* *************************************  Bit definition for ADC_SQR3 register  ************************************* */
#define ADC_SQR3_SQ10_Pos        (0U)
#define ADC_SQR3_SQ10_Msk        (0x1FUL << ADC_SQR3_SQ10_Pos)         /*!< 0x0000001F */
#define ADC_SQR3_SQ10            ADC_SQR3_SQ10_Msk                     /*!< 10th conversion in regular sequence */
#define ADC_SQR3_SQ10_0          (0x1UL << ADC_SQR3_SQ10_Pos)          /*!< 0x00000001 */
#define ADC_SQR3_SQ10_1          (0x2UL << ADC_SQR3_SQ10_Pos)          /*!< 0x00000002 */
#define ADC_SQR3_SQ10_2          (0x4UL << ADC_SQR3_SQ10_Pos)          /*!< 0x00000004 */
#define ADC_SQR3_SQ10_3          (0x8UL << ADC_SQR3_SQ10_Pos)          /*!< 0x00000008 */
#define ADC_SQR3_SQ10_4          (0x10UL << ADC_SQR3_SQ10_Pos)         /*!< 0x00000010 */
#define ADC_SQR3_SQ11_Pos        (6U)
#define ADC_SQR3_SQ11_Msk        (0x1FUL << ADC_SQR3_SQ11_Pos)         /*!< 0x000007C0 */
#define ADC_SQR3_SQ11            ADC_SQR3_SQ11_Msk                     /*!< 11th conversion in regular sequence */
#define ADC_SQR3_SQ11_0          (0x1UL << ADC_SQR3_SQ11_Pos)          /*!< 0x00000040 */
#define ADC_SQR3_SQ11_1          (0x2UL << ADC_SQR3_SQ11_Pos)          /*!< 0x00000080 */
#define ADC_SQR3_SQ11_2          (0x4UL << ADC_SQR3_SQ11_Pos)          /*!< 0x00000100 */
#define ADC_SQR3_SQ11_3          (0x8UL << ADC_SQR3_SQ11_Pos)          /*!< 0x00000200 */
#define ADC_SQR3_SQ11_4          (0x10UL << ADC_SQR3_SQ11_Pos)         /*!< 0x00000400 */
#define ADC_SQR3_SQ12_Pos        (12U)
#define ADC_SQR3_SQ12_Msk        (0x1FUL << ADC_SQR3_SQ12_Pos)         /*!< 0x0001F000 */
#define ADC_SQR3_SQ12            ADC_SQR3_SQ12_Msk                     /*!< 12th conversion in regular sequence */
#define ADC_SQR3_SQ12_0          (0x1UL << ADC_SQR3_SQ12_Pos)          /*!< 0x00001000 */
#define ADC_SQR3_SQ12_1          (0x2UL << ADC_SQR3_SQ12_Pos)          /*!< 0x00002000 */
#define ADC_SQR3_SQ12_2          (0x4UL << ADC_SQR3_SQ12_Pos)          /*!< 0x00004000 */
#define ADC_SQR3_SQ12_3          (0x8UL << ADC_SQR3_SQ12_Pos)          /*!< 0x00008000 */
#define ADC_SQR3_SQ12_4          (0x10UL << ADC_SQR3_SQ12_Pos)         /*!< 0x00010000 */
#define ADC_SQR3_SQ13_Pos        (18U)
#define ADC_SQR3_SQ13_Msk        (0x1FUL << ADC_SQR3_SQ13_Pos)         /*!< 0x007C0000 */
#define ADC_SQR3_SQ13            ADC_SQR3_SQ13_Msk                     /*!< 13th conversion in regular sequence */
#define ADC_SQR3_SQ13_0          (0x1UL << ADC_SQR3_SQ13_Pos)          /*!< 0x00040000 */
#define ADC_SQR3_SQ13_1          (0x2UL << ADC_SQR3_SQ13_Pos)          /*!< 0x00080000 */
#define ADC_SQR3_SQ13_2          (0x4UL << ADC_SQR3_SQ13_Pos)          /*!< 0x00100000 */
#define ADC_SQR3_SQ13_3          (0x8UL << ADC_SQR3_SQ13_Pos)          /*!< 0x00200000 */
#define ADC_SQR3_SQ13_4          (0x10UL << ADC_SQR3_SQ13_Pos)         /*!< 0x00400000 */
#define ADC_SQR3_SQ14_Pos        (24U)
#define ADC_SQR3_SQ14_Msk        (0x1FUL << ADC_SQR3_SQ14_Pos)         /*!< 0x1F000000 */
#define ADC_SQR3_SQ14            ADC_SQR3_SQ14_Msk                     /*!< 14th conversion in regular sequence */
#define ADC_SQR3_SQ14_0          (0x1UL << ADC_SQR3_SQ14_Pos)          /*!< 0x01000000 */
#define ADC_SQR3_SQ14_1          (0x2UL << ADC_SQR3_SQ14_Pos)          /*!< 0x02000000 */
#define ADC_SQR3_SQ14_2          (0x4UL << ADC_SQR3_SQ14_Pos)          /*!< 0x04000000 */
#define ADC_SQR3_SQ14_3          (0x8UL << ADC_SQR3_SQ14_Pos)          /*!< 0x08000000 */
#define ADC_SQR3_SQ14_4          (0x10UL << ADC_SQR3_SQ14_Pos)         /*!< 0x10000000 */

/* *************************************  Bit definition for ADC_SQR4 register  ************************************* */
#define ADC_SQR4_SQ15_Pos        (0U)
#define ADC_SQR4_SQ15_Msk        (0x1FUL << ADC_SQR4_SQ15_Pos)         /*!< 0x0000001F */
#define ADC_SQR4_SQ15            ADC_SQR4_SQ15_Msk                     /*!< 15th conversion in regular sequence */
#define ADC_SQR4_SQ15_0          (0x1UL << ADC_SQR4_SQ15_Pos)          /*!< 0x00000001 */
#define ADC_SQR4_SQ15_1          (0x2UL << ADC_SQR4_SQ15_Pos)          /*!< 0x00000002 */
#define ADC_SQR4_SQ15_2          (0x4UL << ADC_SQR4_SQ15_Pos)          /*!< 0x00000004 */
#define ADC_SQR4_SQ15_3          (0x8UL << ADC_SQR4_SQ15_Pos)          /*!< 0x00000008 */
#define ADC_SQR4_SQ15_4          (0x10UL << ADC_SQR4_SQ15_Pos)         /*!< 0x00000010 */
#define ADC_SQR4_SQ16_Pos        (6U)
#define ADC_SQR4_SQ16_Msk        (0x1FUL << ADC_SQR4_SQ16_Pos)         /*!< 0x000007C0 */
#define ADC_SQR4_SQ16            ADC_SQR4_SQ16_Msk                     /*!< 16th conversion in regular sequence */
#define ADC_SQR4_SQ16_0          (0x1UL << ADC_SQR4_SQ16_Pos)          /*!< 0x00000040 */
#define ADC_SQR4_SQ16_1          (0x2UL << ADC_SQR4_SQ16_Pos)          /*!< 0x00000080 */
#define ADC_SQR4_SQ16_2          (0x4UL << ADC_SQR4_SQ16_Pos)          /*!< 0x00000100 */
#define ADC_SQR4_SQ16_3          (0x8UL << ADC_SQR4_SQ16_Pos)          /*!< 0x00000200 */
#define ADC_SQR4_SQ16_4          (0x10UL << ADC_SQR4_SQ16_Pos)         /*!< 0x00000400 */

/* **************************************  Bit definition for ADC_DR register  ************************************** */
#define ADC_DR_RDATA_Pos         (0U)
#define ADC_DR_RDATA_Msk         (0xFFFFFFFFUL << ADC_DR_RDATA_Pos)    /*!< 0xFFFFFFFF */
#define ADC_DR_RDATA             ADC_DR_RDATA_Msk                      /*!< Regular data converted */
#define ADC_DR_RDATA_0           (0x1UL << ADC_DR_RDATA_Pos)           /*!< 0x00000001 */
#define ADC_DR_RDATA_1           (0x2UL << ADC_DR_RDATA_Pos)           /*!< 0x00000002 */
#define ADC_DR_RDATA_2           (0x4UL << ADC_DR_RDATA_Pos)           /*!< 0x00000004 */
#define ADC_DR_RDATA_3           (0x8UL << ADC_DR_RDATA_Pos)           /*!< 0x00000008 */
#define ADC_DR_RDATA_4           (0x10UL << ADC_DR_RDATA_Pos)          /*!< 0x00000010 */
#define ADC_DR_RDATA_5           (0x20UL << ADC_DR_RDATA_Pos)          /*!< 0x00000020 */
#define ADC_DR_RDATA_6           (0x40UL << ADC_DR_RDATA_Pos)          /*!< 0x00000040 */
#define ADC_DR_RDATA_7           (0x80UL << ADC_DR_RDATA_Pos)          /*!< 0x00000080 */
#define ADC_DR_RDATA_8           (0x100UL << ADC_DR_RDATA_Pos)         /*!< 0x00000100 */
#define ADC_DR_RDATA_9           (0x200UL << ADC_DR_RDATA_Pos)         /*!< 0x00000200 */
#define ADC_DR_RDATA_10          (0x400UL << ADC_DR_RDATA_Pos)         /*!< 0x00000400 */
#define ADC_DR_RDATA_11          (0x800UL << ADC_DR_RDATA_Pos)         /*!< 0x00000800 */
#define ADC_DR_RDATA_12          (0x1000UL << ADC_DR_RDATA_Pos)        /*!< 0x00001000 */
#define ADC_DR_RDATA_13          (0x2000UL << ADC_DR_RDATA_Pos)        /*!< 0x00002000 */
#define ADC_DR_RDATA_14          (0x4000UL << ADC_DR_RDATA_Pos)        /*!< 0x00004000 */
#define ADC_DR_RDATA_15          (0x8000UL << ADC_DR_RDATA_Pos)        /*!< 0x00008000 */
#define ADC_DR_RDATA_16          (0x10000UL << ADC_DR_RDATA_Pos)       /*!< 0x00010000 */
#define ADC_DR_RDATA_17          (0x20000UL << ADC_DR_RDATA_Pos)       /*!< 0x00020000 */
#define ADC_DR_RDATA_18          (0x40000UL << ADC_DR_RDATA_Pos)       /*!< 0x00040000 */
#define ADC_DR_RDATA_19          (0x80000UL << ADC_DR_RDATA_Pos)       /*!< 0x00080000 */
#define ADC_DR_RDATA_20          (0x100000UL << ADC_DR_RDATA_Pos)      /*!< 0x00100000 */
#define ADC_DR_RDATA_21          (0x200000UL << ADC_DR_RDATA_Pos)      /*!< 0x00200000 */
#define ADC_DR_RDATA_22          (0x400000UL << ADC_DR_RDATA_Pos)      /*!< 0x00400000 */
#define ADC_DR_RDATA_23          (0x800000UL << ADC_DR_RDATA_Pos)      /*!< 0x00800000 */
#define ADC_DR_RDATA_24          (0x1000000UL << ADC_DR_RDATA_Pos)     /*!< 0x01000000 */
#define ADC_DR_RDATA_25          (0x2000000UL << ADC_DR_RDATA_Pos)     /*!< 0x02000000 */
#define ADC_DR_RDATA_26          (0x4000000UL << ADC_DR_RDATA_Pos)     /*!< 0x04000000 */
#define ADC_DR_RDATA_27          (0x8000000UL << ADC_DR_RDATA_Pos)     /*!< 0x08000000 */
#define ADC_DR_RDATA_28          (0x10000000UL << ADC_DR_RDATA_Pos)    /*!< 0x10000000 */
#define ADC_DR_RDATA_29          (0x20000000UL << ADC_DR_RDATA_Pos)    /*!< 0x20000000 */
#define ADC_DR_RDATA_30          (0x40000000UL << ADC_DR_RDATA_Pos)    /*!< 0x40000000 */
#define ADC_DR_RDATA_31          (0x80000000UL << ADC_DR_RDATA_Pos)    /*!< 0x80000000 */

/* *************************************  Bit definition for ADC_JSQR register  ************************************* */
#define ADC_JSQR_JLEN_Pos        (0U)
#define ADC_JSQR_JLEN_Msk        (0x3UL << ADC_JSQR_JLEN_Pos)          /*!< 0x00000003 */
#define ADC_JSQR_JLEN            ADC_JSQR_JLEN_Msk                     /*!< Injected channel sequence length */
#define ADC_JSQR_JLEN_0          (0x1UL << ADC_JSQR_JLEN_Pos)          /*!< 0x00000001 */
#define ADC_JSQR_JLEN_1          (0x2UL << ADC_JSQR_JLEN_Pos)          /*!< 0x00000002 */
#define ADC_JSQR_JEXTSEL_Pos     (2U)
#define ADC_JSQR_JEXTSEL_Msk     (0x1FUL << ADC_JSQR_JEXTSEL_Pos)      /*!< 0x0000007C */
#define ADC_JSQR_JEXTSEL         ADC_JSQR_JEXTSEL_Msk                  /*!< External trigger selection for injected
                                                                            group */
#define ADC_JSQR_JEXTSEL_0       (0x1UL << ADC_JSQR_JEXTSEL_Pos)       /*!< 0x00000004 */
#define ADC_JSQR_JEXTSEL_1       (0x2UL << ADC_JSQR_JEXTSEL_Pos)       /*!< 0x00000008 */
#define ADC_JSQR_JEXTSEL_2       (0x4UL << ADC_JSQR_JEXTSEL_Pos)       /*!< 0x00000010 */
#define ADC_JSQR_JEXTSEL_3       (0x8UL << ADC_JSQR_JEXTSEL_Pos)       /*!< 0x00000020 */
#define ADC_JSQR_JEXTSEL_4       (0x10UL << ADC_JSQR_JEXTSEL_Pos)      /*!< 0x00000040 */
#define ADC_JSQR_JEXTEN_Pos      (7U)
#define ADC_JSQR_JEXTEN_Msk      (0x3UL << ADC_JSQR_JEXTEN_Pos)        /*!< 0x00000180 */
#define ADC_JSQR_JEXTEN          ADC_JSQR_JEXTEN_Msk                   /*!< External trigger enable and polarity
                                                                            selection for injected channels */
#define ADC_JSQR_JEXTEN_0        (0x1UL << ADC_JSQR_JEXTEN_Pos)        /*!< 0x00000080 */
#define ADC_JSQR_JEXTEN_1        (0x2UL << ADC_JSQR_JEXTEN_Pos)        /*!< 0x00000100 */
#define ADC_JSQR_JSQ1_Pos        (9U)
#define ADC_JSQR_JSQ1_Msk        (0x1FUL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00003E00 */
#define ADC_JSQR_JSQ1            ADC_JSQR_JSQ1_Msk                     /*!< 1st conversion in the injected sequence */
#define ADC_JSQR_JSQ1_0          (0x1UL << ADC_JSQR_JSQ1_Pos)          /*!< 0x00000200 */
#define ADC_JSQR_JSQ1_1          (0x2UL << ADC_JSQR_JSQ1_Pos)          /*!< 0x00000400 */
#define ADC_JSQR_JSQ1_2          (0x4UL << ADC_JSQR_JSQ1_Pos)          /*!< 0x00000800 */
#define ADC_JSQR_JSQ1_3          (0x8UL << ADC_JSQR_JSQ1_Pos)          /*!< 0x00001000 */
#define ADC_JSQR_JSQ1_4          (0x10UL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00002000 */
#define ADC_JSQR_JSQ2_Pos        (15U)
#define ADC_JSQR_JSQ2_Msk        (0x1FUL << ADC_JSQR_JSQ2_Pos)         /*!< 0x000F8000 */
#define ADC_JSQR_JSQ2            ADC_JSQR_JSQ2_Msk                     /*!< 2nd conversion in the injected sequence */
#define ADC_JSQR_JSQ2_0          (0x1UL << ADC_JSQR_JSQ2_Pos)          /*!< 0x00008000 */
#define ADC_JSQR_JSQ2_1          (0x2UL << ADC_JSQR_JSQ2_Pos)          /*!< 0x00010000 */
#define ADC_JSQR_JSQ2_2          (0x4UL << ADC_JSQR_JSQ2_Pos)          /*!< 0x00020000 */
#define ADC_JSQR_JSQ2_3          (0x8UL << ADC_JSQR_JSQ2_Pos)          /*!< 0x00040000 */
#define ADC_JSQR_JSQ2_4          (0x10UL << ADC_JSQR_JSQ2_Pos)         /*!< 0x00080000 */
#define ADC_JSQR_JSQ3_Pos        (21U)
#define ADC_JSQR_JSQ3_Msk        (0x1FUL << ADC_JSQR_JSQ3_Pos)         /*!< 0x03E00000 */
#define ADC_JSQR_JSQ3            ADC_JSQR_JSQ3_Msk                     /*!< 3rd conversion in the injected sequence */
#define ADC_JSQR_JSQ3_0          (0x1UL << ADC_JSQR_JSQ3_Pos)          /*!< 0x00200000 */
#define ADC_JSQR_JSQ3_1          (0x2UL << ADC_JSQR_JSQ3_Pos)          /*!< 0x00400000 */
#define ADC_JSQR_JSQ3_2          (0x4UL << ADC_JSQR_JSQ3_Pos)          /*!< 0x00800000 */
#define ADC_JSQR_JSQ3_3          (0x8UL << ADC_JSQR_JSQ3_Pos)          /*!< 0x01000000 */
#define ADC_JSQR_JSQ3_4          (0x10UL << ADC_JSQR_JSQ3_Pos)         /*!< 0x02000000 */
#define ADC_JSQR_JSQ4_Pos        (27U)
#define ADC_JSQR_JSQ4_Msk        (0x1FUL << ADC_JSQR_JSQ4_Pos)         /*!< 0xF8000000 */
#define ADC_JSQR_JSQ4            ADC_JSQR_JSQ4_Msk                     /*!< 4th conversion in the injected sequence */
#define ADC_JSQR_JSQ4_0          (0x1UL << ADC_JSQR_JSQ4_Pos)          /*!< 0x08000000 */
#define ADC_JSQR_JSQ4_1          (0x2UL << ADC_JSQR_JSQ4_Pos)          /*!< 0x10000000 */
#define ADC_JSQR_JSQ4_2          (0x4UL << ADC_JSQR_JSQ4_Pos)          /*!< 0x20000000 */
#define ADC_JSQR_JSQ4_3          (0x8UL << ADC_JSQR_JSQ4_Pos)          /*!< 0x40000000 */
#define ADC_JSQR_JSQ4_4          (0x10UL << ADC_JSQR_JSQ4_Pos)         /*!< 0x80000000 */

/* ************************************  Bit definition for ADC_OFCFGR register  ************************************ */
#define ADC_OFCFGR_POSOFF_Pos    (24U)
#define ADC_OFCFGR_POSOFF_Msk    (0x1UL << ADC_OFCFGR_POSOFF_Pos)      /*!< 0x01000000 */
#define ADC_OFCFGR_POSOFF        ADC_OFCFGR_POSOFF_Msk                 /*!< Positive offset enable */
#define ADC_OFCFGR_USAT_Pos      (25U)
#define ADC_OFCFGR_USAT_Msk      (0x1UL << ADC_OFCFGR_USAT_Pos)        /*!< 0x02000000 */
#define ADC_OFCFGR_USAT          ADC_OFCFGR_USAT_Msk                   /*!< Unsigned saturation enable */
#define ADC_OFCFGR_SSAT_Pos      (26U)
#define ADC_OFCFGR_SSAT_Msk      (0x1UL << ADC_OFCFGR_SSAT_Pos)        /*!< 0x04000000 */
#define ADC_OFCFGR_SSAT          ADC_OFCFGR_SSAT_Msk                   /*!< Signed saturation enable */
#define ADC_OFCFGR_OFFSET_CH_Pos (27U)
#define ADC_OFCFGR_OFFSET_CH_Msk (0x1FUL << ADC_OFCFGR_OFFSET_CH_Pos)  /*!< 0xF8000000 */
#define ADC_OFCFGR_OFFSET_CH     ADC_OFCFGR_OFFSET_CH_Msk              /*!< Channel selection for the data offset y */
#define ADC_OFCFGR_OFFSET_CH_0   (0x01UL << ADC_OFCFGR_OFFSET_CH_Pos)  /*!< 0x08000000 */
#define ADC_OFCFGR_OFFSET_CH_1   (0x02UL << ADC_OFCFGR_OFFSET_CH_Pos)  /*!< 0x10000000 */
#define ADC_OFCFGR_OFFSET_CH_2   (0x03UL << ADC_OFCFGR_OFFSET_CH_Pos)  /*!< 0x20000000 */
#define ADC_OFCFGR_OFFSET_CH_3   (0x04UL << ADC_OFCFGR_OFFSET_CH_Pos)  /*!< 0x40000000 */
#define ADC_OFCFGR_OFFSET_CH_4   (0x05UL << ADC_OFCFGR_OFFSET_CH_Pos)  /*!< 0x80000000 */

/* *************************************  Bit definition for ADC_OFR register  ************************************** */
#define ADC_OFR_OFFSET_Pos       (0U)
#define ADC_OFR_OFFSET_Msk       (0x3FFFFFUL << ADC_OFR_OFFSET_Pos)    /*!< 0x003FFFFF */
#define ADC_OFR_OFFSET           ADC_OFR_OFFSET_Msk                    /*!< Data offset y for the channel programmed in
                                                                            OFFSETy_CH[4:0] bits */
#define ADC_OFR_OFFSET_0         (0x1UL << ADC_OFR_OFFSET_Pos)         /*!< 0x00000001 */
#define ADC_OFR_OFFSET_1         (0x2UL << ADC_OFR_OFFSET_Pos)         /*!< 0x00000002 */
#define ADC_OFR_OFFSET_2         (0x4UL << ADC_OFR_OFFSET_Pos)         /*!< 0x00000004 */
#define ADC_OFR_OFFSET_3         (0x8UL << ADC_OFR_OFFSET_Pos)         /*!< 0x00000008 */
#define ADC_OFR_OFFSET_4         (0x10UL << ADC_OFR_OFFSET_Pos)        /*!< 0x00000010 */
#define ADC_OFR_OFFSET_5         (0x20UL << ADC_OFR_OFFSET_Pos)        /*!< 0x00000020 */
#define ADC_OFR_OFFSET_6         (0x40UL << ADC_OFR_OFFSET_Pos)        /*!< 0x00000040 */
#define ADC_OFR_OFFSET_7         (0x80UL << ADC_OFR_OFFSET_Pos)        /*!< 0x00000080 */
#define ADC_OFR_OFFSET_8         (0x100UL << ADC_OFR_OFFSET_Pos)       /*!< 0x00000100 */
#define ADC_OFR_OFFSET_9         (0x200UL << ADC_OFR_OFFSET_Pos)       /*!< 0x00000200 */
#define ADC_OFR_OFFSET_10        (0x400UL << ADC_OFR_OFFSET_Pos)       /*!< 0x00000400 */
#define ADC_OFR_OFFSET_11        (0x800UL << ADC_OFR_OFFSET_Pos)       /*!< 0x00000800 */
#define ADC_OFR_OFFSET_12        (0x1000UL << ADC_OFR_OFFSET_Pos)      /*!< 0x00001000 */
#define ADC_OFR_OFFSET_13        (0x2000UL << ADC_OFR_OFFSET_Pos)      /*!< 0x00002000 */
#define ADC_OFR_OFFSET_14        (0x4000UL << ADC_OFR_OFFSET_Pos)      /*!< 0x00004000 */
#define ADC_OFR_OFFSET_15        (0x8000UL << ADC_OFR_OFFSET_Pos)      /*!< 0x00008000 */
#define ADC_OFR_OFFSET_16        (0x10000UL << ADC_OFR_OFFSET_Pos)     /*!< 0x00010000 */
#define ADC_OFR_OFFSET_17        (0x20000UL << ADC_OFR_OFFSET_Pos)     /*!< 0x00020000 */
#define ADC_OFR_OFFSET_18        (0x40000UL << ADC_OFR_OFFSET_Pos)     /*!< 0x00040000 */
#define ADC_OFR_OFFSET_19        (0x80000UL << ADC_OFR_OFFSET_Pos)     /*!< 0x00080000 */
#define ADC_OFR_OFFSET_20        (0x100000UL << ADC_OFR_OFFSET_Pos)    /*!< 0x00100000 */
#define ADC_OFR_OFFSET_21        (0x200000UL << ADC_OFR_OFFSET_Pos)    /*!< 0x00200000 */

/* ************************************  Bit definition for ADC_GCOMP register  ************************************* */
#define ADC_GCOMP_GCOMPCOEFF_Pos (0U)
#define ADC_GCOMP_GCOMPCOEFF_Msk (0x3FFFUL << ADC_GCOMP_GCOMPCOEFF_Pos)/*!< 0x00003FFF */
#define ADC_GCOMP_GCOMPCOEFF     ADC_GCOMP_GCOMPCOEFF_Msk              /*!< Gain compensation coefficient */
#define ADC_GCOMP_GCOMP_Pos      (31U)
#define ADC_GCOMP_GCOMP_Msk      (0x1UL << ADC_GCOMP_GCOMP_Pos)        /*!< 0x80000000 */
#define ADC_GCOMP_GCOMP          ADC_GCOMP_GCOMP_Msk                   /*!< Gain compensation mode */

