MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c551xx.h
/* ***********************************  Bit definition for RCC_AHB2RSTR register  *********************************** */
#define RCC_AHB2RSTR_Rst              (0x00000000UL)                             /*!< RCC_AHB2RSTR reset value */
#define RCC_AHB2RSTR_GPIOARST_Pos     (0U)
#define RCC_AHB2RSTR_GPIOARST_Msk     (0x1UL << RCC_AHB2RSTR_GPIOARST_Pos)       /*!< 0x00000001 */
#define RCC_AHB2RSTR_GPIOARST         RCC_AHB2RSTR_GPIOARST_Msk                  /*!< GPIOA reset */
#define RCC_AHB2RSTR_GPIOBRST_Pos     (1U)
#define RCC_AHB2RSTR_GPIOBRST_Msk     (0x1UL << RCC_AHB2RSTR_GPIOBRST_Pos)       /*!< 0x00000002 */
#define RCC_AHB2RSTR_GPIOBRST         RCC_AHB2RSTR_GPIOBRST_Msk                  /*!< GPIOB reset */
#define RCC_AHB2RSTR_GPIOCRST_Pos     (2U)
#define RCC_AHB2RSTR_GPIOCRST_Msk     (0x1UL << RCC_AHB2RSTR_GPIOCRST_Pos)       /*!< 0x00000004 */
#define RCC_AHB2RSTR_GPIOCRST         RCC_AHB2RSTR_GPIOCRST_Msk                  /*!< GPIOC reset */
#define RCC_AHB2RSTR_GPIODRST_Pos     (3U)
#define RCC_AHB2RSTR_GPIODRST_Msk     (0x1UL << RCC_AHB2RSTR_GPIODRST_Pos)       /*!< 0x00000008 */
#define RCC_AHB2RSTR_GPIODRST         RCC_AHB2RSTR_GPIODRST_Msk                  /*!< GPIOD reset */
#define RCC_AHB2RSTR_GPIOERST_Pos     (4U)
#define RCC_AHB2RSTR_GPIOERST_Msk     (0x1UL << RCC_AHB2RSTR_GPIOERST_Pos)       /*!< 0x00000010 */
#define RCC_AHB2RSTR_GPIOERST         RCC_AHB2RSTR_GPIOERST_Msk                  /*!< GPIOE reset */
#define RCC_AHB2RSTR_GPIOHRST_Pos     (7U)
#define RCC_AHB2RSTR_GPIOHRST_Msk     (0x1UL << RCC_AHB2RSTR_GPIOHRST_Pos)       /*!< 0x00000080 */
#define RCC_AHB2RSTR_GPIOHRST         RCC_AHB2RSTR_GPIOHRST_Msk                  /*!< GPIOH reset */
#define RCC_AHB2RSTR_ADC12RST_Pos     (10U)
#define RCC_AHB2RSTR_ADC12RST_Msk     (0x1UL << RCC_AHB2RSTR_ADC12RST_Pos)       /*!< 0x00000400 */
#define RCC_AHB2RSTR_ADC12RST         RCC_AHB2RSTR_ADC12RST_Msk                  /*!< ADC1 and ADC2 reset */
#define RCC_AHB2RSTR_DAC1RST_Pos      (11U)
#define RCC_AHB2RSTR_DAC1RST_Msk      (0x1UL << RCC_AHB2RSTR_DAC1RST_Pos)        /*!< 0x00000800 */
#define RCC_AHB2RSTR_DAC1RST          RCC_AHB2RSTR_DAC1RST_Msk                   /*!< DAC reset */
#define RCC_AHB2RSTR_HASHRST_Pos      (17U)
#define RCC_AHB2RSTR_HASHRST_Msk      (0x1UL << RCC_AHB2RSTR_HASHRST_Pos)        /*!< 0x00020000 */
#define RCC_AHB2RSTR_HASHRST          RCC_AHB2RSTR_HASHRST_Msk                   /*!< HASH reset */
#define RCC_AHB2RSTR_RNGRST_Pos       (18U)
#define RCC_AHB2RSTR_RNGRST_Msk       (0x1UL << RCC_AHB2RSTR_RNGRST_Pos)         /*!< 0x00040000 */
#define RCC_AHB2RSTR_RNGRST           RCC_AHB2RSTR_RNGRST_Msk                    /*!< RNG reset */

/* **********************************  Bit definition for RCC_APB1LRSTR register  *********************************** */
#define RCC_APB1LRSTR_Rst             (0x00000000UL)                             /*!< RCC_APB1LRSTR reset value */
#define RCC_APB1LRSTR_TIM2RST_Pos     (0U)
#define RCC_APB1LRSTR_TIM2RST_Msk     (0x1UL << RCC_APB1LRSTR_TIM2RST_Pos)       /*!< 0x00000001 */
#define RCC_APB1LRSTR_TIM2RST         RCC_APB1LRSTR_TIM2RST_Msk                  /*!< TIM2 reset */
#define RCC_APB1LRSTR_TIM5RST_Pos     (3U)
#define RCC_APB1LRSTR_TIM5RST_Msk     (0x1UL << RCC_APB1LRSTR_TIM5RST_Pos)       /*!< 0x00000008 */
#define RCC_APB1LRSTR_TIM5RST         RCC_APB1LRSTR_TIM5RST_Msk                  /*!< TIM5 reset */
#define RCC_APB1LRSTR_TIM6RST_Pos     (4U)
#define RCC_APB1LRSTR_TIM6RST_Msk     (0x1UL << RCC_APB1LRSTR_TIM6RST_Pos)       /*!< 0x00000010 */
#define RCC_APB1LRSTR_TIM6RST         RCC_APB1LRSTR_TIM6RST_Msk                  /*!< TIM6 reset */
#define RCC_APB1LRSTR_TIM7RST_Pos     (5U)
#define RCC_APB1LRSTR_TIM7RST_Msk     (0x1UL << RCC_APB1LRSTR_TIM7RST_Pos)       /*!< 0x00000020 */
#define RCC_APB1LRSTR_TIM7RST         RCC_APB1LRSTR_TIM7RST_Msk                  /*!< TIM7 reset */
#define RCC_APB1LRSTR_TIM12RST_Pos    (6U)
#define RCC_APB1LRSTR_TIM12RST_Msk    (0x1UL << RCC_APB1LRSTR_TIM12RST_Pos)      /*!< 0x00000040 */
#define RCC_APB1LRSTR_TIM12RST        RCC_APB1LRSTR_TIM12RST_Msk                 /*!< TIM12 reset */
#define RCC_APB1LRSTR_OPAMP1RST_Pos   (13U)
#define RCC_APB1LRSTR_OPAMP1RST_Msk   (0x1UL << RCC_APB1LRSTR_OPAMP1RST_Pos)     /*!< 0x00002000 */
#define RCC_APB1LRSTR_OPAMP1RST       RCC_APB1LRSTR_OPAMP1RST_Msk                /*!< OPAMP1 reset */
#define RCC_APB1LRSTR_SPI2RST_Pos     (14U)
#define RCC_APB1LRSTR_SPI2RST_Msk     (0x1UL << RCC_APB1LRSTR_SPI2RST_Pos)       /*!< 0x00004000 */
#define RCC_APB1LRSTR_SPI2RST         RCC_APB1LRSTR_SPI2RST_Msk                  /*!< SPI2 reset */
#define RCC_APB1LRSTR_SPI3RST_Pos     (15U)
#define RCC_APB1LRSTR_SPI3RST_Msk     (0x1UL << RCC_APB1LRSTR_SPI3RST_Pos)       /*!< 0x00008000 */
#define RCC_APB1LRSTR_SPI3RST         RCC_APB1LRSTR_SPI3RST_Msk                  /*!< SPI3 reset */
#define RCC_APB1LRSTR_USART2RST_Pos   (17U)
#define RCC_APB1LRSTR_USART2RST_Msk   (0x1UL << RCC_APB1LRSTR_USART2RST_Pos)     /*!< 0x00020000 */
#define RCC_APB1LRSTR_USART2RST       RCC_APB1LRSTR_USART2RST_Msk                /*!< USART2 reset */
#define RCC_APB1LRSTR_USART3RST_Pos   (18U)
#define RCC_APB1LRSTR_USART3RST_Msk   (0x1UL << RCC_APB1LRSTR_USART3RST_Pos)     /*!< 0x00040000 */
#define RCC_APB1LRSTR_USART3RST       RCC_APB1LRSTR_USART3RST_Msk                /*!< USART3 reset */
#define RCC_APB1LRSTR_UART4RST_Pos    (19U)
#define RCC_APB1LRSTR_UART4RST_Msk    (0x1UL << RCC_APB1LRSTR_UART4RST_Pos)      /*!< 0x00080000 */
#define RCC_APB1LRSTR_UART4RST        RCC_APB1LRSTR_UART4RST_Msk                 /*!< UART4 reset */
#define RCC_APB1LRSTR_UART5RST_Pos    (20U)
#define RCC_APB1LRSTR_UART5RST_Msk    (0x1UL << RCC_APB1LRSTR_UART5RST_Pos)      /*!< 0x00100000 */
#define RCC_APB1LRSTR_UART5RST        RCC_APB1LRSTR_UART5RST_Msk                 /*!< UART5 reset */
#define RCC_APB1LRSTR_I2C1RST_Pos     (21U)
#define RCC_APB1LRSTR_I2C1RST_Msk     (0x1UL << RCC_APB1LRSTR_I2C1RST_Pos)       /*!< 0x00200000 */
#define RCC_APB1LRSTR_I2C1RST         RCC_APB1LRSTR_I2C1RST_Msk                  /*!< I2C1 reset */
#define RCC_APB1LRSTR_I2C2RST_Pos     (22U)
#define RCC_APB1LRSTR_I2C2RST_Msk     (0x1UL << RCC_APB1LRSTR_I2C2RST_Pos)       /*!< 0x00400000 */
#define RCC_APB1LRSTR_I2C2RST         RCC_APB1LRSTR_I2C2RST_Msk                  /*!< I2C2 reset */
#define RCC_APB1LRSTR_I3C1RST_Pos     (23U)
#define RCC_APB1LRSTR_I3C1RST_Msk     (0x1UL << RCC_APB1LRSTR_I3C1RST_Pos)       /*!< 0x00800000 */
#define RCC_APB1LRSTR_I3C1RST         RCC_APB1LRSTR_I3C1RST_Msk                  /*!< I3C1 block reset */
#define RCC_APB1LRSTR_CRSRST_Pos      (24U)
#define RCC_APB1LRSTR_CRSRST_Msk      (0x1UL << RCC_APB1LRSTR_CRSRST_Pos)        /*!< 0x01000000 */
#define RCC_APB1LRSTR_CRSRST          RCC_APB1LRSTR_CRSRST_Msk                   /*!< CRS reset */

/* **********************************  Bit definition for RCC_APB1HRSTR register  *********************************** */
#define RCC_APB1HRSTR_Rst             (0x00000000UL)                             /*!< RCC_APB1HRSTR reset value */
#define RCC_APB1HRSTR_COMP12RST_Pos   (3U)
#define RCC_APB1HRSTR_COMP12RST_Msk   (0x1UL << RCC_APB1HRSTR_COMP12RST_Pos)     /*!< 0x00000008 */
#define RCC_APB1HRSTR_COMP12RST       RCC_APB1HRSTR_COMP12RST_Msk                /*!< COMP1 and COMP2 reset */

/* ***********************************  Bit definition for RCC_APB2RSTR register  *********************************** */
#define RCC_APB2RSTR_Rst              (0x00000000UL)                             /*!< RCC_APB2RSTR reset value */
#define RCC_APB2RSTR_TIM1RST_Pos      (11U)
#define RCC_APB2RSTR_TIM1RST_Msk      (0x1UL << RCC_APB2RSTR_TIM1RST_Pos)        /*!< 0x00000800 */
#define RCC_APB2RSTR_TIM1RST          RCC_APB2RSTR_TIM1RST_Msk                   /*!< TIM1 reset */
#define RCC_APB2RSTR_SPI1RST_Pos      (12U)
#define RCC_APB2RSTR_SPI1RST_Msk      (0x1UL << RCC_APB2RSTR_SPI1RST_Pos)        /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST          RCC_APB2RSTR_SPI1RST_Msk                   /*!< SPI1 reset */
#define RCC_APB2RSTR_TIM8RST_Pos      (13U)
#define RCC_APB2RSTR_TIM8RST_Msk      (0x1UL << RCC_APB2RSTR_TIM8RST_Pos)        /*!< 0x00002000 */
#define RCC_APB2RSTR_TIM8RST          RCC_APB2RSTR_TIM8RST_Msk                   /*!< TIM8 reset */
#define RCC_APB2RSTR_USART1RST_Pos    (14U)
#define RCC_APB2RSTR_USART1RST_Msk    (0x1UL << RCC_APB2RSTR_USART1RST_Pos)      /*!< 0x00004000 */
#define RCC_APB2RSTR_USART1RST        RCC_APB2RSTR_USART1RST_Msk                 /*!< USART1 reset */
#define RCC_APB2RSTR_TIM15RST_Pos     (16U)
#define RCC_APB2RSTR_TIM15RST_Msk     (0x1UL << RCC_APB2RSTR_TIM15RST_Pos)       /*!< 0x00010000 */
#define RCC_APB2RSTR_TIM15RST         RCC_APB2RSTR_TIM15RST_Msk                  /*!< TIM15 reset */
#define RCC_APB2RSTR_TIM16RST_Pos     (17U)
#define RCC_APB2RSTR_TIM16RST_Msk     (0x1UL << RCC_APB2RSTR_TIM16RST_Pos)       /*!< 0x00020000 */
#define RCC_APB2RSTR_TIM16RST         RCC_APB2RSTR_TIM16RST_Msk                  /*!< TIM16 reset */
#define RCC_APB2RSTR_TIM17RST_Pos     (18U)
#define RCC_APB2RSTR_TIM17RST_Msk     (0x1UL << RCC_APB2RSTR_TIM17RST_Pos)       /*!< 0x00040000 */
#define RCC_APB2RSTR_TIM17RST         RCC_APB2RSTR_TIM17RST_Msk                  /*!< TIM17 reset */
#define RCC_APB2RSTR_USBRST_Pos       (24U)
#define RCC_APB2RSTR_USBRST_Msk       (0x1UL << RCC_APB2RSTR_USBRST_Pos)         /*!< 0x01000000 */
#define RCC_APB2RSTR_USBRST           RCC_APB2RSTR_USBRST_Msk                    /*!< USBRST (USB block reset) */

/* ***********************************  Bit definition for RCC_APB3RSTR register  *********************************** */
#define RCC_APB3RSTR_Rst              (0x00000000UL)                             /*!< RCC_APB3RSTR reset value */
#define RCC_APB3RSTR_SBSRST_Pos       (1U)
#define RCC_APB3RSTR_SBSRST_Msk       (0x1UL << RCC_APB3RSTR_SBSRST_Pos)         /*!< 0x00000002 */
#define RCC_APB3RSTR_SBSRST           RCC_APB3RSTR_SBSRST_Msk                    /*!< SBS reset */
#define RCC_APB3RSTR_LPUART1RST_Pos   (6U)
#define RCC_APB3RSTR_LPUART1RST_Msk   (0x1UL << RCC_APB3RSTR_LPUART1RST_Pos)     /*!< 0x00000040 */
#define RCC_APB3RSTR_LPUART1RST       RCC_APB3RSTR_LPUART1RST_Msk                /*!< LPUART1 reset */
#define RCC_APB3RSTR_LPTIM1RST_Pos    (11U)
#define RCC_APB3RSTR_LPTIM1RST_Msk    (0x1UL << RCC_APB3RSTR_LPTIM1RST_Pos)      /*!< 0x00000800 */
#define RCC_APB3RSTR_LPTIM1RST        RCC_APB3RSTR_LPTIM1RST_Msk                 /*!< LPTIM1RST (LPTIM1 block reset) */

