MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c551xx.h
/********************  Bits definition for TAMP_BKP8R register  ****************/
#define TAMP_BKP8R_BKP_Pos                 (0U)
#define TAMP_BKP8R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP8R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP8R_BKP                     TAMP_BKP8R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP9R register  ****************/
#define TAMP_BKP9R_BKP_Pos                 (0U)
#define TAMP_BKP9R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP9R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP9R_BKP                     TAMP_BKP9R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP10R register  ***************/
#define TAMP_BKP10R_BKP_Pos                (0U)
#define TAMP_BKP10R_BKP_Msk                (0xFFFFFFFFUL << TAMP_BKP10R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP10R_BKP                    TAMP_BKP10R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP11R register  ***************/
#define TAMP_BKP11R_BKP_Pos                (0U)
#define TAMP_BKP11R_BKP_Msk                (0xFFFFFFFFUL << TAMP_BKP11R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP11R_BKP                    TAMP_BKP11R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP12R register  ***************/
#define TAMP_BKP12R_BKP_Pos                (0U)
#define TAMP_BKP12R_BKP_Msk                (0xFFFFFFFFUL << TAMP_BKP12R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP12R_BKP                    TAMP_BKP12R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP13R register  ***************/
#define TAMP_BKP13R_BKP_Pos               (0U)
#define TAMP_BKP13R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP13R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP13R_BKP                   TAMP_BKP13R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP14R register  ***************/
#define TAMP_BKP14R_BKP_Pos               (0U)
#define TAMP_BKP14R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP14R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP14R_BKP                   TAMP_BKP14R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP15R register  ***************/
#define TAMP_BKP15R_BKP_Pos               (0U)
#define TAMP_BKP15R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP15R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP15R_BKP                   TAMP_BKP15R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP16R register  ***************/
#define TAMP_BKP16R_BKP_Pos               (0U)
#define TAMP_BKP16R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP16R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP16R_BKP                   TAMP_BKP16R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP17R register  ***************/
#define TAMP_BKP17R_BKP_Pos               (0U)
#define TAMP_BKP17R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP17R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP17R_BKP                   TAMP_BKP17R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP18R register  ***************/
#define TAMP_BKP18R_BKP_Pos               (0U)
#define TAMP_BKP18R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP18R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP18R_BKP                   TAMP_BKP18R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP19R register  ***************/
#define TAMP_BKP19R_BKP_Pos               (0U)
#define TAMP_BKP19R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP19R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP19R_BKP                   TAMP_BKP19R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP20R register  ***************/
#define TAMP_BKP20R_BKP_Pos               (0U)
#define TAMP_BKP20R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP20R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP20R_BKP                   TAMP_BKP20R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP21R register  ***************/
#define TAMP_BKP21R_BKP_Pos               (0U)
#define TAMP_BKP21R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP21R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP21R_BKP                   TAMP_BKP21R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP22R register  ***************/
#define TAMP_BKP22R_BKP_Pos               (0U)
#define TAMP_BKP22R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP22R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP22R_BKP                   TAMP_BKP22R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP23R register  ***************/
#define TAMP_BKP23R_BKP_Pos               (0U)
#define TAMP_BKP23R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP23R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP23R_BKP                   TAMP_BKP23R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

