MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c551xx.h
/*!< STAT_TX[1:0] STATus for TX transfer */
#define USB_EP_TX_DIS                              (0x00000000UL)           /*!< EndPoint TX Disabled */
#define USB_EP_TX_STALL                            (0x00000010UL)           /*!< EndPoint TX STALLed */
#define USB_EP_TX_NAK                              (0x00000020UL)           /*!< EndPoint TX NAKed */
#define USB_EP_TX_VALID                            (0x00000030UL)           /*!< EndPoint TX VALID */

#define USB_CH_TX_DIS                              (0x00000000UL)           /*!< Channel TX Disabled */
#define USB_CH_TX_STALL                            (0x00000010UL)           /*!< Channel TX STALLed */
#define USB_CH_TX_NAK                              (0x00000020UL)           /*!< Channel TX NAKed */
#define USB_CH_TX_VALID                            (0x00000030UL)           /*!< Channel TX VALID */

#define USB_EP_TX_ACK_SBUF                         (0x00000000UL)           /*!< ACK single buffer mode */
#define USB_EP_TX_ACK_DBUF                         (0x00000030UL)           /*!< ACK Double buffer mode */

#define USB_CH_TX_ACK_SBUF                         (0x00000000UL)           /*!< ACK single buffer mode */
#define USB_CH_TX_ACK_DBUF                         (0x00000030UL)           /*!< ACK Double buffer mode */

/*!< STAT_RX[1:0] STATus for RX transfer */
#define USB_EP_RX_DIS                              (0x00000000UL)           /*!< EndPoint RX Disabled */
#define USB_EP_RX_STALL                            (0x00001000UL)           /*!< EndPoint RX STALLed */
#define USB_EP_RX_NAK                              (0x00002000UL)           /*!< EndPoint RX NAKed */
#define USB_EP_RX_VALID                            (0x00003000UL)           /*!< EndPoint RX VALID */

#define USB_EP_RX_ACK_SBUF                         (0x00000000UL)           /*!< ACK single buffer mode */
#define USB_EP_RX_ACK_DBUF                         (0x00003000UL)           /*!< ACK Double buffer mode */

#define USB_CH_RX_DIS                              (0x00000000UL)           /*!< EndPoint RX Disabled */
#define USB_CH_RX_STALL                            (0x00001000UL)           /*!< EndPoint RX STALLed */
#define USB_CH_RX_NAK                              (0x00002000UL)           /*!< Channel RX NAKed */
#define USB_CH_RX_VALID                            (0x00003000UL)           /*!< Channel RX VALID */

#define USB_CH_RX_ACK_SBUF                         (0x00000000UL)           /*!< ACK single buffer mode */
#define USB_CH_RX_ACK_DBUF                         (0x00003000UL)           /*!< ACK Double buffer mode */

/*! <used For Double Buffer Enable Disable */
#define USB_CHEP_DB_MSK                            (0xFFFF0F0FUL)

/*!< Buffer Descriptor Mask */
#define USB_PMA_TXBD_ADDMSK                        (0xFFFF0000UL)
#define USB_PMA_TXBD_COUNTMSK                      (0x0000FFFFUL)
#define USB_PMA_RXBD_ADDMSK                        (0xFFFF0000UL)

/*!< USB PMA SIZE */
#define USB_DRD_PMA_SIZE                           (2048U)                  /*!< USB PMA Size 2Kbyte */

#define USB_DRD_FS_EP_NBR                          (8U)                     /*!< Number of USB Device endpoints */
#define USB_DRD_FS_CH_NBR                          (8U)                     /*!< Number of USB Host channels */

/* legacy defines */
/* USB_CHEP register legacy aliases */
#define USB_CHEP_ADDR_Pos          USB_CHEP_EA_Pos
#define USB_CHEP_ADDR_Msk          USB_CHEP_EA_Msk
#define USB_CHEP_ADDR              USB_CHEP_EA

#define USB_CHEP_TX_STTX_Pos       USB_CHEP_STATTX_Pos
#define USB_CHEP_TX_STTX_Msk       USB_CHEP_STATTX_Msk
#define USB_CHEP_TX_STTX           USB_CHEP_STATTX
#define USB_EP_TX_STTX             USB_CHEP_STATTX
#define USB_CH_TX_STTX             USB_CHEP_STATTX

#define USB_CHEP_DTOG_TX_Pos       USB_CHEP_DTOGTX_Pos
#define USB_CHEP_DTOG_TX_Msk       USB_CHEP_DTOGTX_Msk
#define USB_CHEP_DTOG_TX           USB_CHEP_DTOGTX
#define USB_EP_DTOG_TX             USB_CHEP_DTOGTX
#define USB_CH_DTOG_TX             USB_CHEP_DTOGTX

#define USB_CHEP_RX_STRX_Pos       USB_CHEP_STATRX_Pos
#define USB_CHEP_RX_STRX_Msk       USB_CHEP_STATRX_Msk
#define USB_CHEP_RX_STRX           USB_CHEP_STATRX
#define USB_EP_RX_STRX             USB_CHEP_STATRX
#define USB_CH_RX_STRX             USB_CHEP_STATRX

#define USB_CHEP_DTOG_RX_Pos       USB_CHEP_DTOGRX_Pos
#define USB_CHEP_DTOG_RX_Msk       USB_CHEP_DTOGRX_Msk
#define USB_CHEP_DTOG_RX           USB_CHEP_DTOGRX
#define USB_EP_DTOG_RX             USB_CHEP_DTOGRX
#define USB_CH_DTOG_RX             USB_CHEP_DTOGRX

#define USB_CHEP_LSEP_Pos          USB_CHEP_LS_EP_Pos
#define USB_CHEP_LSEP_Msk          USB_CHEP_LS_EP_Msk
#define USB_CHEP_LSEP              USB_CHEP_LS_EP

#define USB_CHEP_ERRTX_Pos         USB_CHEP_ERR_TX_Pos
#define USB_CHEP_ERRTX_Msk         USB_CHEP_ERR_TX_Msk
#define USB_CHEP_ERRTX             USB_CHEP_ERR_TX
#define USB_EP_ERRTX               USB_CHEP_ERR_TX
#define USB_CH_ERRTX               USB_CHEP_ERR_TX

#define USB_CHEP_ERRRX_Pos         USB_CHEP_ERR_RX_Pos
#define USB_CHEP_ERRRX_Msk         USB_CHEP_ERR_RX_Msk
#define USB_CHEP_ERRRX             USB_CHEP_ERR_RX
#define USB_EP_ERRRX               USB_CHEP_ERR_RX
#define USB_CH_ERRRX               USB_CHEP_ERR_RX

#define USB_CHEP_KIND_Pos          USB_CHEP_EPKIND_Pos
#define USB_CHEP_KIND_Msk          USB_CHEP_EPKIND_Msk
#define USB_CHEP_KIND              USB_CHEP_EPKIND

/* Provide EP/CH KIND aliases based on new EPKIND field */
#define USB_EP_EPKIND              USB_CHEP_EPKIND
#define USB_CH_EPKIND              USB_CHEP_EPKIND
#define USB_EP_KIND                USB_EP_EPKIND
#define USB_CH_KIND                USB_CH_EPKIND

/* USB_CNTR register legacy aliases */
#define USB_CNTR_RESETM_Pos        USB_CNTR_RST_DCONM_Pos
#define USB_CNTR_RESETM_Msk        USB_CNTR_RST_DCONM_Msk
#define USB_CNTR_RESETM            USB_CNTR_RST_DCONM
#define USB_CNTR_DCON              USB_CNTR_RST_DCONM

/* USB_ISTR register legacy aliases */
#define USB_ISTR_RESET_Pos         USB_ISTR_RST_DCON_Pos
#define USB_ISTR_RESET_Msk         USB_ISTR_RST_DCON_Msk
#define USB_ISTR_RESET             USB_ISTR_RST_DCON
#define USB_ISTR_DCON              USB_ISTR_RST_DCON

#define USB_ISTR_LS_DCONN_Pos      USB_ISTR_LS_DCON_Pos
#define USB_ISTR_LS_DCONN_Msk      USB_ISTR_LS_DCON_Msk
#define USB_ISTR_LS_DCONN          USB_ISTR_LS_DCON

/* USB_LPMCSR register legacy aliases */
#define USB_LPMCSR_LMPEN_Pos       USB_LPMCSR_LPMEN_Pos
#define USB_LPMCSR_LMPEN_Msk       USB_LPMCSR_LPMEN_Msk
#define USB_LPMCSR_LMPEN           USB_LPMCSR_LPMEN

/* USB_BCDR register legacy aliases */
#define USB_BCDR_DPPU_Pos          USB_BCDR_DPPU_DPD_Pos
#define USB_BCDR_DPPU_Msk          USB_BCDR_DPPU_DPD_Msk
#define USB_BCDR_DPPU              USB_BCDR_DPPU_DPD
#define USB_BCDR_DPPD_Pos          USB_BCDR_DPPU_DPD_Pos
#define USB_BCDR_DPPD_Msk          USB_BCDR_DPPU_DPD_Msk
#define USB_BCDR_DPPD              USB_BCDR_DPPU_DPD

/******************************************************************************/
/*                                                                            */
/*                            Independent WATCHDOG                            */
/*                                                                            */
/******************************************************************************/

